# More Basics of Pandas

Last session we introduced Pandas quickly. Now we review the basics of using Pandas, with a more interactive workflow to solidify understanding and facility with this powerful Python toolkit.

## Reviewing Pandas Basics

In [1]:
from pandas import DataFrame
import pandas as pd

In [2]:
import pandas as pd
df = pd.read_csv('DEC_10_SF1_P1_with_ann.csv')

### Basics of indexing in Pandas

The first use of indexing is to use a slice, just like we have done with other Python objects. Below we slice the first 5 index values of the first dimension of the dataframe.

In [4]:
df[:5]

df['Id'][:5]

0    1400000US21001970100
1    1400000US21001970200
2    1400000US21001970300
3    1400000US21001970401
4    1400000US21001970402
Name: Id, dtype: object

The first indexing method is equivalent to usinf the iloc indexing method, which uses the integer based indexing, purely based on the location of the index.

In [ ]:
df.iloc[:5]

A second way to index is using loc, which uses the labels of the index. Note that this approach includes the second value in the index range, whereas iloc does not.

In [ ]:
df.loc[:5]

Note that indexing can work for both rows and colums

In [ ]:
df.loc[:5, : 'Geography']

In [ ]:
df.iloc[:5, :3]

We can select rows based on their value as well.  Notice that we nest df[df[condition]] to get this result.

In [8]:
df[(df['Population'] < 200)]

,Id,Id2,Geography,Population
64,1400000US21015980100,21015980100,"Census Tract 9801, Boone County, Kentucky",0
124,1400000US21029980100,21029980100,"Census Tract 9801, Bullitt County, Kentucky",0
203,1400000US21047980100,21047980100,"Census Tract 9801, Christian County, Kentucky",0
255,1400000US21061980100,21061980100,"Census Tract 9801, Edmonson County, Kentucky",8
678,1400000US21111980100,21111980100,"Census Tract 9801, Jefferson County, Kentucky",0
803,1400000US21143980100,21143980100,"Census Tract 9801, Lyon County, Kentucky",0
878,1400000US21163980100,21163980100,"Census Tract 9801, Meade County, Kentucky",9
1053,1400000US21221980100,21221980100,"Census Tract 9801, Trigg County, Kentucky",18
1054,1400000US21221980200,21221980200,"Census Tract 9802, Trigg County, Kentucky",6

In [ ]:
df[df['Id2']==21015980100]

Here we show how to set a value of a cell in the table, identifying a specific row by index label, and setting its population, in this case to a None value, which Pandas interprets as a NaN (missing value).

In [ ]:
df.loc[688,'Population'] = None

We can filter for values that are Null

In [ ]:
df[df['Population'].isnull()]

Or more commonly, filter out the null values.

In [5]:
df[df['Population'].notnull()]

KeyError: 'Population'

Here we find and print records that are in Fayette County, using the str attribute and 'contains' to search for the county name in geodisplay.

In [9]:
df[df['Geography'].str.contains('Fayette County')]

,Id,Id2,Geography,Population
262,1400000US21067000101,21067000101,"Census Tract 1.01, Fayette County, Kentucky",3072
263,1400000US21067000102,21067000102,"Census Tract 1.02, Fayette County, Kentucky",1567
264,1400000US21067000200,21067000200,"Census Tract 2, Fayette County, Kentucky",3563
265,1400000US21067000300,21067000300,"Census Tract 3, Fayette County, Kentucky",3157
266,1400000US21067000400,21067000400,"Census Tract 4, Fayette County, Kentucky",1261
...,...,...,...,...
339,1400000US21067004205,21067004205,"Census Tract 42.05, Fayette County, Kentucky",6628
340,1400000US21067004207,21067004207,"Census Tract 42.07, Fayette County, Kentucky",3855
341,1400000US21067004208,21067004208,"Census Tract 42.08, Fayette County, Kentucky",7097
342,1400000US21067004209,21067004209,"Census Tract 42.09, Fayette County, Kentucky",3916
343,1400000US21067004210,21067004210,"Census Tract 42.10, Fayette County, Kentucky",4207

We can find the unique values of a column (not very interesting in this particular case)

We saw last time how to use the str attribute to do string manipulation, such as to create a new column.  We need to explore some more advanced string processing, but let's use a smaller dataframe for that.

In [ ]:
df['state'] = df['Geography'].str.split(',').str[2]
df[:5]

In [14]:
df['Census_Tract'] = df['Geography'].str.split(',').str[0]
df[:5]

,Id,Id2,Geography,Population,county,Census_Tract
0,1400000US21001970100,21001970100,"Census Tract 9701, Adair County, Kentucky",1727,County,Census Tract 9701
1,1400000US21001970200,21001970200,"Census Tract 9702, Adair County, Kentucky",1722,County,Census Tract 9702
2,1400000US21001970300,21001970300,"Census Tract 9703, Adair County, Kentucky",3016,County,Census Tract 9703
3,1400000US21001970401,21001970401,"Census Tract 9704.01, Adair County, Kentucky",4070,County,Census Tract 9704.01
4,1400000US21001970402,21001970402,"Census Tract 9704.02, Adair County, Kentucky",4261,County,Census Tract 9704.02

In [ ]:
df['county'].unique()

In [ ]:
df['county'] = df['Geography'].str.split(',').str[1]
df[:5]

And count how many times each unique value is in the data

In [ ]:
df['county'].value_counts()

### More complex use of Indexing and String Manipulation -- Cleaning the Bedroom Field in the Craigslist data

In [15]:
import pandas as pd, numpy as np
cl = pd.read_csv('items.csv')
cl.head()

,neighborhood,title,price,bedrooms,pid,longitude,date,link,latitude,sqft,sourcepage
0,(SOMA / south beach),"1bed + Den, 1bath at Mission Bay",$2895,/ 1br - 950ft² -,4046628359,-122.399663,Sep 4 2013,/sfc/apa/4046628359.html,37.774623,/ 1br - 950ft² -,http://sfbay.craigslist.org/sfc/apa/
1,(SOMA / south beach),Love where you live!,$3354,/ 1br - 710ft² -,4046761563,NaN,Sep 4 2013,/sfc/apa/4046761563.html,NaN,/ 1br - 710ft² -,http://sfbay.craigslist.org/sfc/apa/
2,(inner sunset / UCSF),We Welcome Your Furry Friends! Call Today!,$2865,/ 1br - 644ft² -,4046661504,-122.470727,Sep 4 2013,/sfc/apa/4046661504.html,37.765739,/ 1br - 644ft² -,http://sfbay.craigslist.org/sfc/apa/
3,(financial district),Golden Gateway Commons | 2BR + office townhous...,$5500,/ 2br - 1450ft² -,4036170429,NaN,Sep 4 2013,/sfc/apa/4036170429.html,NaN,/ 2br - 1450ft² -,http://sfbay.craigslist.org/sfc/apa/
4,(lower nob hill),Experience Luxury Living in San Fransisco!,$3892,/ 2br -,4046732678,NaN,Sep 4 2013,/sfc/apa/4046732678.html,NaN,/ 2br -,http://sfbay.craigslist.org/sfc/apa/

This is a worked part of your assignment for this week.  Here is a code snippet that uses some of what we just learned above, and extends it to clean the bedroom field in this data.  Adapting it to clean sqft remains for you to do in the assignment...

Below are two different ways to do this.  The first involves looping over the index of the dataframe, and finding the beginning and end of the substring we are looking for, to isolate the bedrooms value.

In [18]:
cl['bedrooms'].index
isinstance(cl['bedrooms'][label], str)

NameError: name 'label' is not defined

In [ ]:
for label in cl['bedrooms'].index:
    if isinstance(cl['bedrooms'][label], str) and not pd.isnull(cl['bedrooms'][label]):
        end = cl['bedrooms'][label].find('br')
        if end == -1:
            cl.loc[label,'bedrooms'] = np.nan
        else:
            start = cl['bedrooms'][label].find('/ ') + 2
            cl.loc[label,'bedrooms'] = int(cl['bedrooms'][label][start: end])
cl['bedrooms'][:9]

Here is a second way to do this that is much more elegant, and in some ways much simpler since it does not require looping over the index values.  It uses the apply() method to apply an element-wise function.  This is covered briefly on page 133 of Pandas for Data Analysis, and more exensively in online documentation.

In [19]:
# first we create a method that works on a single instance
def clean_br(value):
    ''' value - string from Craigslist entry that includes number of bedrooms
        returns - integer number of bedrooms
    '''
    if isinstance(value, str):
        end = value.find('br')
        if end == -1:
            return None
        else:
            start = value.find('/') + 2
            return int(value[start:end])

In [20]:
# for example, we can apply it to a single string
clean_br('/ 1br - 950ft² -')

1

In [21]:
# and another
clean_br('/ 2br - 1450ft² -')

2

In [22]:
# really what we want to do is to apply it to all rows in a dataframe
# we can do this with a loop, similar to what we have above
cl = pd.read_csv('items.csv')

for i, row in cl.iterrows(): 
    row['bedrooms'] = clean_br(row['bedrooms'])

In [ ]:
# Let's look at the result.  We see that it doesn't change.  What went wrong?
# let's go back and fix it together
cl['bedrooms'][:9]

In [ ]:
# a second option is to use the apply() method.  
# apply() takes the name of a method as an argument, and applies that method to all rows in the dataframe
# the looping is implicit

cl = pd.read_csv('items.csv')
cl['bedrooms'] = cl['bedrooms'].apply(clean_br)
cl['bedrooms'][:9]

In [ ]:
# if we have a very simple function, we can define it all in one line using the keyword lambda

cl['bedrooms_plus2'] = cl['bedrooms'].apply(lambda x : x+2)
cl['bedrooms_plus2'][:9]

In [ ]:
# the above line is equivalent to:
def plus_two(x):
    return x+2

cl['bedrooms_plus2'] = cl['bedrooms'].apply(plus_two)
cl['bedrooms_plus2'][:9]

## Working with Pandas -- an in-class working session

OK, let's create a DataFrame from a dictionary, following the example on pg 116 of Python for Data Analysis (PDA).

In [4]:
import pandas as pd
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = DataFrame(data)

Explain the contents and structure of 'data'

What does 'DataFrame(data)' do? What if we did not begin that line with 'df ='?

Look at the contents of df, using just df by itself, and 'print df'.

In [5]:
df.describe()

             year       pop
count     5.00000  5.000000
mean   2001.20000  2.420000
std       0.83666  0.864292
min    2000.00000  1.500000
25%    2001.00000  1.700000
50%    2001.00000  2.400000
75%    2002.00000  2.900000
max    2002.00000  3.600000

We can refer to a column in two ways:

In [ ]:
df['state']

In [ ]:
df.state

We can step through the rows in a dataframe

In [ ]:
for label in df.state.index:
    print(df.state[label])

And find the index value within each entry of a specific substring

In [ ]:
for label in df.state.index:
    print(df.state[label].find('io'))

In [ ]:
for label in df.state.index:
    if df.state[label]=='Ohio':
        print(df.state[label])
    else:
        print('Missing')

## Now Your Turn

Below are a series of questions, with the answers remaining for you to fill in by using pandas expressions that draw on the methods in Chapter 5.  You should not need to use anything more than the content of this chapter -- a subset of the methods summarized above, to do this exercise.  Hopefully you can complete it within class if you've been keeping up with the reading.

How can we get a quick statistical profile of all the numeric columns?

In [6]:
df.describe()

             year       pop
count     5.00000  5.000000
mean   2001.20000  2.420000
std       0.83666  0.864292
min    2000.00000  1.500000
25%    2001.00000  1.700000
50%    2001.00000  2.400000
75%    2002.00000  2.900000
max    2002.00000  3.600000

Can you get a profile of a column that is not numeric, like state? Try it.

In [8]:
df['state'].describe()

count        5
unique       2
top       Ohio
freq         3
Name: state, dtype: object

How can we print the data types of each column?

In [13]:
df.dtypes

state     object
year       int64
pop      float64
dtype: object

How can we print just the column containing state names?

In [8]:
df.loc[:,'state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

How can we get a list of the states in the DataFrame, without duplicates?

In [11]:
f = df['state'].unique()

In [12]:
print (f)

['Ohio' 'Nevada']

How can we get a count of how many rows we have in each state?

In [14]:
df['state'].value_counts()

Ohio      3
Nevada    2
Name: state, dtype: int64

How can we compute the mean of population across all the rows?

In [26]:
df.mean()

year    2001.20
pop        2.42
dtype: float64

How can we compute the maximum population across all the rows?

In [15]:
df['pop'].max()

3.6

How can we compute the 20th percentile value of population?

How can we compute a Boolean array indicating whether the state is 'Ohio'?

In [19]:
df['state']=='Ohio'

0     True
1     True
2     True
3    False
4    False
Name: state, dtype: bool

How can we select and print just the rows for Ohio?

In [21]:
df[df['state']=='Ohio']

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

How can we create a new DataFrame containing only the Ohio records?

In [23]:
dfOhio = df[df['state']=='Ohio']
dfOhio

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

How can we select and print just the rows in which population is more than 2?

In [25]:
df[df['pop']>2]

    state  year  pop
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

How could we compute the mean of population that is in Ohio, averaging across years?

In [28]:
df[df['state']=='Ohio'][['pop']].mean()

pop    2.266667
dtype: float64

How can we print the DataFrame, sorted by State and within State, by Population?

In [30]:
df.sort_values(['state','pop'])

    state  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6

How can we print the row for Ohio, 2002, selecting on its values (not on row and column indexes)?

In [40]:
df[(df['state']=='Ohio') & (df['year']== 2002)]

  state  year  pop
2  Ohio  2002  3.6

How can we use row and column indexing to set the population of Ohio in 2002 to 3.4?

In [42]:
df.loc[2,'pop']=3.4

How can we use row and column indexing to append a new record for Utah, initially with no population or year?

In [43]:
df.loc[5,'state']="Utah"

How can we set the population to 2.5 and year to 2001 for the new record?

In [44]:
df.loc[5,'pop']=2.5

In [45]:
df.loc[5,'year']=2001

In [46]:
df

    state    year  pop
0    Ohio  2000.0  1.5
1    Ohio  2001.0  1.7
2    Ohio  2002.0  3.4
3  Nevada  2001.0  2.4
4  Nevada  2002.0  2.9
5    Utah  2001.0  2.5